// SPDX-License-Identifier: MIT
// Copyright (c) 2018-2023, Advanced Micro Devices, Inc. All rights reserved.

#pragma once

#include "ck_tile/core/numeric/integer.hpp"
#include "ck_tile/core/numeric/integral_constant.hpp"
#include "ck_tile/core/container/container_helper.hpp"
#include "ck_tile/core/utility/type_traits.hpp"
#include "ck_tile/core/numeric/vector_type.hpp"

namespace ck_tile {

template <typename T>
union buffer_resource
{
    CK_TILE_DEVICE constexpr buffer_resource() : content{} {}

    // 128 bit SGPRs to supply buffer resource in buffer instructions
    // https://rocm-documentation.readthedocs.io/en/latest/GCN_ISA_Manuals/testdocbook.html#vector-memory-buffer-instructions
    int32x4_t content;
    statically_indexed_array<T*, 2> address;
    statically_indexed_array<int32_t, 4> range;
    statically_indexed_array<int32_t, 4> config;
};

template <typename T>
CK_TILE_DEVICE int32x4_t make_wave_buffer_resource(T* p_wave, index_t element_space_size)
{
    buffer_resource<T> wave_buffer_resource;

    // wavewise base address (64 bit)
    wave_buffer_resource.address(number<0>{}) = const_cast<remove_cv_t<T>*>(p_wave);
    // wavewise range (32 bit)
    wave_buffer_resource.range(number<2>{}) = element_space_size * sizeof(T);
    // wavewise setting (32 bit)
    wave_buffer_resource.config(number<3>{}) = CK_BUFFER_RESOURCE_3RD_DWORD;

    return wave_buffer_resource.content;
}

template <typename T>
CK_TILE_DEVICE int32x4_t make_wave_buffer_resource_with_default_range(T* p_wave)
{
    buffer_resource<T> wave_buffer_resource;

    // wavewise base address (64 bit)
    wave_buffer_resource.address(number<0>{}) = const_cast<remove_cv_t<T>*>(p_wave);
    // wavewise range (32 bit)
    wave_buffer_resource.range(number<2>{}) = 0xffffffff; // max possible range
    // wavewise setting (32 bit)
    wave_buffer_resource.config(number<3>{}) = CK_BUFFER_RESOURCE_3RD_DWORD;

    return wave_buffer_resource.content;
}

// TODO: glc/slc/...
template <index_t bytes>
struct buffer_load;
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wundefined-reinterpret-cast"
// TODO: strict aliasing rule seems fail when reinterpret_cast between vector type
// (exp_vector_type(xxx))
template <>
struct buffer_load<16>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t /*flag*/ = 0)
    {
        static_assert(sizeof(T) == 16);
        using mubuf_t = float __attribute__((ext_vector_type(4)));
        asm volatile("buffer_load_dwordx4 %0, %1, %2, %3 offen offset:%4"
                     : "+v"(reinterpret_cast<mubuf_t&>(value))
                     : "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset)
                     : "memory");
    }
};

template <>
struct buffer_load<8>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t /*flag*/ = 0)
    {
        static_assert(sizeof(T) == 8);
        using mubuf_t = float __attribute__((ext_vector_type(2)));
        asm volatile("buffer_load_dwordx2 %0, %1, %2, %3 offen offset:%4"
                     : "+v"(reinterpret_cast<mubuf_t&>(value))
                     : "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset)
                     : "memory");
    }
};

template <>
struct buffer_load<4>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t /*flag*/ = 0)
    {
        static_assert(sizeof(T) == 4);
        using mubuf_t = float;
        asm volatile("buffer_load_dword %0, %1, %2, %3 offen offset:%4"
                     : "+v"(reinterpret_cast<mubuf_t&>(value))
                     : "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset)
                     : "memory");
    }
};

template <>
struct buffer_load<2>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t /*flag*/ = 0)
    {
        static_assert(sizeof(T) == 4); // subdword is buggy, use dword buf and convert manually
        using mubuf_t = float;
        asm volatile("buffer_load_ushort %0, %1, %2, %3 offen offset:%4"
                     : "+v"(reinterpret_cast<mubuf_t&>(value))
                     : "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset)
                     : "memory");
    }
};

template <>
struct buffer_load<1>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t /*flag*/ = 0)
    {
        static_assert(sizeof(T) == 4);
        using mubuf_t = float;
        asm volatile("buffer_load_ubyte %0, %1, %2, %3 offen offset:%4"
                     : "+v"(reinterpret_cast<mubuf_t&>(value))
                     : "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset)
                     : "memory");
    }
};

template <index_t bytes>
struct buffer_load_if;

template <>
struct buffer_load_if<16>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t flag = 0)
    {
        static_assert(sizeof(T) == 16);
        auto saved_exec = __builtin_amdgcn_read_exec();
        using mubuf_t   = float __attribute__((ext_vector_type(4)));
        static_assert(sizeof(mubuf_t) == sizeof(T));
        asm volatile(
            "v_cmpx_le_u32 exec, 1, %5\n"
            "buffer_load_dwordx4 %0, %1, %2, %3 offen offset:%4\n"
            "s_mov_b64 exec %6"
            : "+v"(reinterpret_cast<mubuf_t&>(value))
            : "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset), "v"(flag), "s"(saved_exec)
            : "memory");
    }
};

template <>
struct buffer_load_if<8>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t flag = 0)
    {
        static_assert(sizeof(T) == 8);
        auto saved_exec = __builtin_amdgcn_read_exec();
        using mubuf_t   = float __attribute__((ext_vector_type(2)));
        asm volatile(
            "v_cmpx_le_u32 exec, 1, %5\n"
            "buffer_load_dwordx2 %0, %1, %2, %3 offen offset:%4\n"
            "s_mov_b64 exec %6"
            : "+v"(reinterpret_cast<mubuf_t&>(value))
            : "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset), "v"(flag), "s"(saved_exec)
            : "memory");
    }
};

template <>
struct buffer_load_if<4>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t flag = 0)
    {
        static_assert(sizeof(T) == 4);
        auto saved_exec = __builtin_amdgcn_read_exec();
        using mubuf_t   = float;
        asm volatile(
            "v_cmpx_le_u32 exec, 1, %5\n"
            "buffer_load_dword %0, %1, %2, %3 offen offset:%4\n"
            "s_mov_b64 exec %6"
            : "+v"(reinterpret_cast<mubuf_t&>(value))
            : "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset), "v"(flag), "s"(saved_exec)
            : "memory");
    }
};

template <>
struct buffer_load_if<2>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t flag = 0)
    {
        static_assert(sizeof(T) == 4);
        auto saved_exec = __builtin_amdgcn_read_exec();
        using mubuf_t   = float;
        asm volatile(
            "v_cmpx_le_u32 exec, 1, %5\n"
            "buffer_load_ushort %0, %1, %2, %3 offen offset:%4\n"
            "s_mov_b64 exec %6"
            : "+v"(reinterpret_cast<mubuf_t&>(value))
            : "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset), "v"(flag), "s"(saved_exec)
            : "memory");
    }
};

template <>
struct buffer_load_if<1>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t flag = 0)
    {
        static_assert(sizeof(T) == 4);
        auto saved_exec = __builtin_amdgcn_read_exec();
        using mubuf_t   = float;
        asm volatile(
            "v_cmpx_le_u32 exec, 1, %5\n"
            "buffer_load_ubyte %0, %1, %2, %3 offen offset:%4\n"
            "s_mov_b64 exec %6"
            : "+v"(reinterpret_cast<mubuf_t&>(value))
            : "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset), "v"(flag), "s"(saved_exec)
            : "memory");
    }
};
#pragma clang diagnostic pop // "-Wundefined-reinterpret-cast"
template <index_t bytes>
struct buffer_store;

template <>
struct buffer_store<16>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(const T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t /*flag*/ = 1)
    {
        static_assert(sizeof(T) == 16);
        asm volatile("buffer_store_dwordx4 %0, %1, %2, %3 offen offset:%4"
                     :
                     : "v"(value), "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset)
                     : "memory");
    }
};

template <>
struct buffer_store<8>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(const T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t /*flag*/ = 1)
    {
        static_assert(sizeof(T) == 8);
        asm volatile("buffer_store_dwordx2 %0, %1, %2, %3 offen offset:%4"
                     :
                     : "v"(value), "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset)
                     : "memory");
    }
};

template <>
struct buffer_store<4>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(const T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t /*flag*/ = 1)
    {
        static_assert(sizeof(T) == 4);
        asm volatile("buffer_store_dword %0, %1, %2, %3 offen offset:%4"
                     :
                     : "v"(value), "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset)
                     : "memory");
    }
};

template <>
struct buffer_store<2>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(const T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t /*flag*/ = 1)
    {
        static_assert(sizeof(T) == 2);
        asm volatile("buffer_store_short %0, %1, %2, %3 offen offset:%4"
                     :
                     : "v"(value), "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset)
                     : "memory");
    }
};

template <>
struct buffer_store<1>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(const T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t /*flag*/ = 1)
    {
        static_assert(sizeof(T) == 1);
        asm volatile("buffer_store_byte %0, %1, %2, %3 offen offset:%4"
                     :
                     : "v"(value), "v"(v_offset), "s"(res), "s"(s_offset), "n"(i_offset)
                     : "memory");
    }
};

template <index_t bytes>
struct buffer_store_if;

template <>
struct buffer_store_if<16>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(const T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t flag = 1)
    {
        static_assert(sizeof(T) == 16);
        auto save_exec = __builtin_amdgcn_read_exec();
        asm volatile("v_cmpx_le_u32 exec, 1, %5\n"
                     "buffer_store_dwordx4 %0, %1, %2, %3 offen offset:%4\n"
                     "s_mov_b64 exec %6"
                     :
                     : "v"(value),
                       "v"(v_offset),
                       "s"(res),
                       "s"(s_offset),
                       "n"(i_offset),
                       "v"(flag),
                       "s"(save_exec)
                     : "memory");
    }
};

template <>
struct buffer_store_if<8>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(const T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t flag = 1)
    {
        static_assert(sizeof(T) == 8);
        auto save_exec = __builtin_amdgcn_read_exec();
        asm volatile("v_cmpx_le_u32 exec, 1, %5\n"
                     "buffer_store_dwordx2 %0, %1, %2, %3 offen offset:%4\n"
                     "s_mov_b64 exec %6"
                     :
                     : "v"(value),
                       "v"(v_offset),
                       "s"(res),
                       "s"(s_offset),
                       "n"(i_offset),
                       "v"(flag),
                       "s"(save_exec)
                     : "memory");
    }
};

template <>
struct buffer_store_if<4>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(const T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t flag = 1)
    {
        static_assert(sizeof(T) == 4);
        auto save_exec = __builtin_amdgcn_read_exec();
        asm volatile("v_cmpx_le_u32 exec, 1, %5\n"
                     "buffer_store_dword %0, %1, %2, %3 offen offset:%4\n"
                     "s_mov_b64 exec %6"
                     :
                     : "v"(value),
                       "v"(v_offset),
                       "s"(res),
                       "s"(s_offset),
                       "n"(i_offset),
                       "v"(flag),
                       "s"(save_exec)
                     : "memory");
    }
};

template <>
struct buffer_store_if<2>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(const T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t flag = 1)
    {
        static_assert(sizeof(T) == 2);
        auto save_exec = __builtin_amdgcn_read_exec();
        asm volatile("v_cmpx_le_u32 exec, 1, %5\n"
                     "buffer_store_short %0, %1, %2, %3 offen offset:%4\n"
                     "s_mov_b64 exec %6"
                     :
                     : "v"(value),
                       "v"(v_offset),
                       "s"(res),
                       "s"(s_offset),
                       "n"(i_offset),
                       "v"(flag),
                       "s"(save_exec)
                     : "memory");
    }
};

template <>
struct buffer_store_if<1>
{
    template <typename T>
    CK_TILE_DEVICE void operator()(const T& value,
                                   int32x4_t res /*buffer resource*/,
                                   index_t v_offset,
                                   index_t s_offset,
                                   index_t i_offset /*max 0xFFF*/,
                                   index_t flag = 1)
    {
        static_assert(sizeof(T) == 1);
        auto save_exec = __builtin_amdgcn_read_exec();
        asm volatile("v_cmpx_le_u32 exec, 1, %5\n"
                     "buffer_store_byte %0, %1, %2, %3 offen offset:%4\n"
                     "s_mov_b64 exec %6"
                     :
                     : "v"(value),
                       "v"(v_offset),
                       "s"(res),
                       "s"(s_offset),
                       "n"(i_offset),
                       "v"(flag),
                       "s"(save_exec)
                     : "memory");
    }
};

CK_TILE_DEVICE void buffer_load_fence(index_t cnt = 0)
{
    asm volatile("s_waitcnt vmcnt(%0)" : : "n"(cnt) : "memory");
}

// clang-format off
namespace impl{

// can't use "+v" since there could be potential extra move(read/write)
// use "v" can help remove such duplicated moves
// besides, fake this as "memory" operation to force later valu after this fence
// TODO: may have scratch (because this is memory?)
